[
    {
        "id": 0,
        "dataset": "g04-uc-req",
        "Name": "Urban traffic flow congestion analysis",
        "Precondition": [
            "The system has retrieved all relevant sensory data and is ready to simulate.",
            "The user is authenticated to use the system (logged in)."
        ],
        "Postcondition": [
            "Cause and effect of different scenarios regarding urban traffic are shown in real-time.",
            "A selection of suggested improvements for traffic flow is shown by the system."
        ],
        "Basic flow": [
            "The user authenticates and is logged into the system.",
            "The system shows the traffic flows of the city, based on historic data.",
            "Congested traffic flows are shown in red.",
            "The user selects a certain area/roads to be improved.",
            "The system suggests traffic flow improvements.",
            "The user selects the best (w.r.t. noise, pollution, costs, people affected) traffic flow improvement.",
            "The system shows the updated traffic flow.",
            "The user retrieves a report of suggested traffic flow improvement and plan of action generated by the system (simulated data).",
            "The report then presented to the respective stakeholder (mayor, for approval or emergency services)."
        ],
        "Actors": [
            "Urban mobility planner"
        ]
    },
    {
        "id": 1,
        "dataset": "g04-uc-req",
        "Name": "Urban traffic flow during big events analysis",
        "Precondition": [
            "The system has retrieved all relevant sensory data and is ready to simulate.",
            "The user is authenticated to use the system (logged in)."
        ],
        "Postcondition": [
            "Cause and effect of different scenarios regarding urban traffic are shown in real-time."
        ],
        "Basic flow": [
            "The user authenticates and is logged into the system.",
            "The system shows the traffic flows of the city, based on historic data.",
            "Congested traffic flows are shown in red.",
            "The user specifies a big event at a certain building/area with an expected number of visitors.",
            "The system shows the traffic flows from before and after the event.",
            "The user selects can tinker around with traffic flow management solutions (blocking certain roads off, redirecting traffic, etc.)",
            "The system shows the updated traffic flow.",
            "The user retrieves a report of suggested traffic flow measurements and plan of action generated by the system (simulated data)."
        ],
        "Actors": [
            "Urban mobility planner"
        ]
    },
    {
        "id": 2,
        "dataset": "g04-uc-req",
        "Name": "Urban traffic flow noise and pollution analysis.",
        "Precondition": [
            "The system has retrieved all relevant sensory data and is ready to simulate.",
            "The user is authenticated to use the system (logged in)."
        ],
        "Postcondition": [
            "Cause and effect of different scenarios regarding urban traffic are shown in real-time."
        ],
        "Basic flow": [
            "Multiple residents filed reports on traffic related issues (noise, pollution,congestion)",
            "The user (media team member) authenticates and is logged into the system.",
            "The system shows the traffic flows of the city, based on historic data.",
            "Areas affected by noise and pollution are highlighted.",
            "Population density is shown.",
            "The user retrieves an overview of areas that are higher than the allowed noise/pollution levels.",
            "The user retrieves a report of suggested traffic flow measurements and plan of action generated by the system (simulated data) in order to lower the noise/pollution levels below certain thresholds",
            "The report is presented to the relevant stakeholders (Mayor, Head of Urban Mobility Department, Residents)."
        ],
        "Actors": [
            "Media team"
        ]
    }
]